joric/bmpapi/nrf5x/usbd.c
#define EXTRA_ENDPOINT_LIST()                                      \
(                                                            \
        NRF_DRV_USBD_EPIN3                                   \
)

#define ABS_MOUSE_ENDPOINT_LIST()                                      \
(                                                            \
        NRF_DRV_USBD_EPIN4                                   \
)
///**
// * @brief Mouse button count
// * */
//static uint8_t m_generic_rep_dsc[] = APP_USBD_HID_MOUSE_REPORT_DSC_BUTTON(MOUSE_BUTTON_COUNT);

static const app_usbd_hid_subclass_desc_t extra_dsc = {
/* todo
  sizeof(ExtrakeyReport),
  APP_USBD_DESCRIPTOR_REPORT,
  ExtrakeyReport
*/
};

static const app_usbd_hid_subclass_desc_t * reps[] = {&extra_dsc};

/**
 * @brief Number of reports defined in report descriptor
 */
#define EXTRA_REPORT_COUNT        1

/**
 * @brief Size of maximum output report. HID generic class will reserve
 *        this buffer size + 1 memory space. */
#define EXTRA_REPORT_OUT_MAXSIZE  0

/*lint -save -e26 -e64 -e123 -e505 -e651*/
#define REPORT_IN_QUEUE_SIZE    1
#define REPORT_OUT_MAXSIZE  0
#define HID_GENERIC_EP_COUNT  1

APP_USBD_HID_GENERIC_GLOBAL_DEF(m_app_hid_extra,
                                APP_USBD_INTERFACE_EXTRA,
                                hid_mouse_user_ev_handler,
                                EXTRA_ENDPOINT_LIST(),
                                reps,
                                REPORT_IN_QUEUE_SIZE,
                                REPORT_OUT_MAXSIZE,
                                APP_USBD_HID_SUBCLASS_NONE,
                                APP_USBD_HID_PROTO_GENERIC);

static const app_usbd_hid_subclass_desc_t abs_mouse_dsc = {
/*todo
  sizeof(AbsMouseReport),
  APP_USBD_DESCRIPTOR_REPORT,
  AbsMouseReport
*/
};

static const app_usbd_hid_subclass_desc_t * abs_mouse_reps[] = {&abs_mouse_dsc};

APP_USBD_HID_GENERIC_GLOBAL_DEF(m_app_hid_abs_mouse,
                                APP_USBD_INTERFACE_ABSMOUSE,
                                hid_mouse_user_ev_handler,
                                ABS_MOUSE_ENDPOINT_LIST(),
                                abs_mouse_reps,
                                REPORT_IN_QUEUE_SIZE,
                                REPORT_OUT_MAXSIZE,
                                APP_USBD_HID_SUBCLASS_NONE,
                                APP_USBD_HID_PROTO_GENERIC);
/*lint -save -e26 -e64 -e123 -e505 -e651*/

/**
 * @brief Global HID mouse instance
 * */
#define MOUSE_BUTTON_COUNT 5
/**
 * @brief Global HID keyboard instance
 * */
//APP_USBD_HID_MOUSE_GLOBAL_DEF(m_app_hid_mouse,
//                              APP_USBD_INTERFACE_MOUSE,
//                              NRF_DRV_USBD_EPIN2,
//                              MOUSE_BUTTON_COUNT,
//                              hid_mouse_user_ev_handler,
//                              APP_USBD_HID_SUBCLASS_BOOT
//);
static const app_usbd_hid_subclass_desc_t mouse_dsc = {
/*todo
  sizeof(MouseReport),
  APP_USBD_DESCRIPTOR_REPORT,
  MouseReport
*/
};

static const app_usbd_hid_subclass_desc_t * mouse_reps[] = {&mouse_dsc};

APP_USBD_HID_GENERIC_GLOBAL_DEF(m_app_hid_mouse,
                                APP_USBD_INTERFACE_MOUSE,
                                hid_mouse_user_ev_handler,
                                (NRF_DRV_USBD_EPIN2),
                                mouse_reps,
                                REPORT_IN_QUEUE_SIZE,
                                REPORT_OUT_MAXSIZE,
                                APP_USBD_HID_SUBCLASS_NONE,
                                APP_USBD_HID_PROTO_GENERIC);

/**
 * @brief Global HID keyboard instance
 */
APP_USBD_HID_KBD_GLOBAL_DEF(m_app_hid_kbd,
                            APP_USBD_INTERFACE_KBD,
                            NRF_DRV_USBD_EPIN1,
                            hid_kbd_user_ev_handler,
                            APP_USBD_HID_SUBCLASS_BOOT
);


static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst,
    app_usbd_cdc_acm_user_event_t event);

#define CDC_ACM_COMM_EPIN       NRF_DRV_USBD_EPIN6
#define CDC_ACM_DATA_EPIN       NRF_DRV_USBD_EPIN5
#define CDC_ACM_DATA_EPOUT      NRF_DRV_USBD_EPOUT2

/**
 * @brief CDC_ACM class instance
 * */
APP_USBD_CDC_ACM_GLOBAL_DEF(m_app_cdc_acm, cdc_acm_user_ev_handler,
    APP_USBD_INTERFACE_CDC_ACM_COMM, APP_USBD_INTERFACE_CDC_ACM_DATA, CDC_ACM_COMM_EPIN,
    CDC_ACM_DATA_EPIN, CDC_ACM_DATA_EPOUT, APP_USBD_CDC_COMM_PROTOCOL_AT_V250);

typedef struct {
  uint8_t* const buf;
  uint16_t widx, ridx, cnt;
  const uint16_t len;
} struct_queue;

#define USB_SERIAL_TX_QUEUE_SIZE 1024UL
#define USB_SERIAL_RX_QUEUE_SIZE 64
static uint8_t tx_buf[USB_SERIAL_TX_QUEUE_SIZE], rx_buf[USB_SERIAL_RX_QUEUE_SIZE];
struct_queue tx_queue={tx_buf, 0, 0, 0, USB_SERIAL_TX_QUEUE_SIZE},
    rx_queue={rx_buf, 0, 0, 0, USB_SERIAL_RX_QUEUE_SIZE};

static size_t push_queue(struct_queue *q, uint8_t dat) {
  if (q->cnt < q->len) {
    q->buf[q->widx++] = dat;
    q->widx %= q->len;
    q->cnt++;
    return 1;
  } else {
    return 0;
  }
}

static size_t pop_queue(struct_queue *q, uint8_t *dat) {
  if (q->cnt) {
    *dat = q->buf[q->ridx++];
    q->ridx %= q->len;
    q->cnt--;
    return 1;
  } else {
    return 0;
  }
}

#define READ_SIZE 1
static char m_rx_buffer[NRF_DRV_USBD_EPSIZE];
static char m_tx_buffer[NRF_DRV_USBD_EPSIZE];
static bool m_send_flag = 0;

static void usbd_send_cdc_acm_internal(void const* p_context, char const *buf, size_t len) {
  ret_code_t ret;
  if (!m_send_flag) {
    len = len & 0xFF;
    memcpy(m_tx_buffer, buf, len);
    ret = app_usbd_cdc_acm_write(&m_app_cdc_acm, m_tx_buffer, len);
    if (ret == NRF_SUCCESS) {
      m_send_flag = true;
    }
  } else {
    uint8_t *p = (uint8_t*)buf;
    while (len--) {
      push_queue(&tx_queue, *p++);
    }
  }
}

void usbd_send_cdc_acm(uint8_t *buf, uint8_t len) {
  usbd_send_cdc_acm_internal(NULL, (char const*)buf, len);
}

