joric/bmpapi/nrf5x/usbd.c
int usbd_init(void) {

  ret_code_t ret;
  static const app_usbd_config_t usbd_config = {
      .ev_state_proc = usbd_user_ev_handler,
  };
//
  ret = nrf_drv_clock_init();
  APP_ERROR_CHECK(ret);

  ret = app_usbd_init(&usbd_config);
  APP_ERROR_CHECK(ret);

  //NRF_LOG_DEBUG("Hello USB!\r\n");

// todo joric
#if 1
  app_usbd_class_inst_t const * class_inst_kbd;
  class_inst_kbd = app_usbd_hid_kbd_class_inst_get(&m_app_hid_kbd);
  ret = app_usbd_class_append(class_inst_kbd);
  APP_ERROR_CHECK(ret);
  ret = app_usbd_class_rwu_register(class_inst_kbd);
  APP_ERROR_CHECK(ret);

  app_usbd_class_inst_t const * class_inst_mouse;
//  class_inst_mouse = app_usbd_hid_mouse_class_inst_get(&m_app_hid_mouse);
  class_inst_mouse = app_usbd_hid_generic_class_inst_get(&m_app_hid_mouse);
  ret = app_usbd_class_append(class_inst_mouse);
  APP_ERROR_CHECK(ret);

  app_usbd_class_inst_t const * class_inst_extra;
  class_inst_extra = app_usbd_hid_generic_class_inst_get(&m_app_hid_extra);
  ret = app_usbd_class_append(class_inst_extra);
  APP_ERROR_CHECK(ret);

  app_usbd_class_inst_t const * class_inst_abs_mouse;
  class_inst_abs_mouse = app_usbd_hid_generic_class_inst_get(&m_app_hid_abs_mouse);
  ret = app_usbd_class_append(class_inst_abs_mouse);
  APP_ERROR_CHECK(ret);
#endif //todo

  app_usbd_class_inst_t const * class_cdc_acm;
  class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
  ret = app_usbd_class_append(class_cdc_acm);
  APP_ERROR_CHECK(ret);

//  cli_init();

  return 0;
}

int usbd_enable(void) {

  // crashes here apparently

  uint32_t  ret = app_usbd_power_events_enable();

  APP_ERROR_CHECK(ret);

  blink(1,500); 

  return ret;
}

void usbd_process(void) {
  while (app_usbd_event_queue_process()) {
    continue;/* Nothing to do */
  }
  //blink(1,50); // gets called allright

  //cli_exec();
}

int usbd_send_kbd_report(app_usbd_hid_kbd_t const *  p_kbd, report_keyboard_t *report);
int usbd_send_mouse_report(app_usbd_hid_mouse_t const *  p_mouse, report_mouse_t *report);
int usbd_send_keyboard(report_keyboard_t *report) {
  NRF_LOG_DEBUG("%d", report->keys[0]);
  uint8_t res = usbd_send_kbd_report(&m_app_hid_kbd, report);
  NRF_LOG_DEBUG("res:%d", res);

  if (nrf_drv_usbd_suspend_check()) {
    app_usbd_wakeup_req();
  }

  return res;
}

int usbd_send_mouse(report_mouse_t *report) {
//  return usbd_send_mouse_report(&m_app_hid_mouse, report);
  return app_usbd_hid_generic_in_report_set(&m_app_hid_mouse, report, 5);
}

int usbd_send_abs_mouse(int8_t x, int8_t y) {
  uint8_t report[2];
  report[0] = x;
  report[1] = y;
  return app_usbd_hid_generic_in_report_set(&m_app_hid_abs_mouse, report, 2);
}

typedef struct {
  uint8_t report_id;
  uint16_t usage;
}__attribute__ ((packed)) report_extra_t;

//todo
#define REPORT_ID_SYSTEM 0
#define REPORT_ID_CONSUMER 1

int usbd_send_system(uint16_t data) {
  report_extra_t report;
  report.report_id = REPORT_ID_SYSTEM;
  report.usage = data;
  uint32_t ret = app_usbd_hid_generic_in_report_set(&m_app_hid_extra, &report,
      sizeof(report_extra_t));
  NRF_LOG_INFO("Send system:%d", data);
  return ret;
}

int usbd_send_consumer(uint16_t data) {
  report_extra_t report;
  report.report_id = REPORT_ID_CONSUMER;
  report.usage = data;
  uint32_t ret = app_usbd_hid_generic_in_report_set(&m_app_hid_extra, &report,
      sizeof(report_extra_t));
  return ret;
}
